README.org
:PROPERTIES:
:ID:       3he2qix0xnj0
:END:
#+title: Emacs ExoBrains Comparison

* TODO intro -- I will write this after more of the document is done, besides being easier and at that point I would probably rewrite it anyway
Why do this
There are a lot of programs to become your ExoBrain all designed with differing philosophies and
maybe write this in kotl complex thoughts
** ExoBrain terms . 
ExoBrain -- external brain | Second Brain -- external computer brain "to be used in conjunction with your brian" -- toss this? getting wordy? | GTD -- getting things done | PIM -- Personal imformation managment | PKM -- Personal knoledge managment | ZettleKasten -- system of interconncted notes | etc...

* ExoBrain packages feature chart


|------------------+----------------+--------------+----------------+--------------+------+-------------+-------------|
| Features         | bi-directional | links in the | pre computer   | Programmatic | docs | tutorials   | Active      |
|                  |          links | wild         | copy and paste | Links        |      |             | development |
|                  |                |              |                |              |      |             |             |
|------------------+----------------+--------------+----------------+--------------+------+-------------+-------------|
| Org Mode         |              1 | ?            | 2?             | 2            |    3 | 2           | 4           |
| Org-Roam         |              4 | N/A          | N/A            | N/A          |      |             |             |
| LogSeq           |              4 | 3            | 4              |              |      |             |             |
| Zk               |                |              |                |              |      |             |             |
| Hyperbole        |                |              |                |              |      | Built in    |             |
| Denote           |                |              |                |              |      | ??          |             |
| Eev              |                |              |                |              |      | Built in    |             |
| Org-Zettelkasten |                |              |                |              |      | ??          |             |
| Zetteldeft       |                |              |                |              |      | [[https://github.com/EFLS/zd-tutorial][zd-tutorial]] |             |
| Deft             |                |              |                |              |      |             |             |
| Org-Brain        |                |              |                |              |      |             |             |
| Bookmark Plus    |                |              |                |              |      |             |             |
| howm             |                |              |                |              |      |             |             |
|------------------+----------------+--------------+----------------+--------------+------+-------------+-------------|

Legend
   1) No feature
   2) kinda has feature
   3) Has feature
   4) Has feature plus extras
*  other interesting projects
* 

