README.md


# TODO intro &#x2013; I will write this after more of the document is done, besides being easier and at that point I would probably rewrite it anyway

Why do this
There are a lot of programs to become your ExoBrain all designed with differing philosophies and
maybe write this in kotl complex thoughts


## ExoBrain terms .

ExoBrain &#x2013; external brain | Second Brain &#x2013; external computer brain "to be used in conjunction with your brian" &#x2013; toss this? getting wordy? | GTD &#x2013; getting things done | PIM &#x2013; Personal information management | PKM &#x2013; Personal knowledge management | Zettelkasten &#x2013; system of interconncted notes | etc&#x2026;


# ExoBrain packages feature chart

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Features</th>
<th scope="col" class="org-right">bi-directional</th>
<th scope="col" class="org-right">links in the</th>
<th scope="col" class="org-right">pre computer</th>
<th scope="col" class="org-left">Programmatic</th>
<th scope="col" class="org-right">docs</th>
<th scope="col" class="org-left">tutorials</th>
<th scope="col" class="org-right">Active</th>
</tr>


<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">links</th>
<th scope="col" class="org-right">wild</th>
<th scope="col" class="org-right">copy and paste</th>
<th scope="col" class="org-left">Links</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">development</th>
</tr>


<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Org Mode</td>
<td class="org-right">1</td>
<td class="org-right">?</td>
<td class="org-right">2?</td>
<td class="org-left">2</td>
<td class="org-right">3</td>
<td class="org-left">2</td>
<td class="org-right">4</td>
</tr>


<tr>
<td class="org-left">Org-Roam</td>
<td class="org-right">4</td>
<td class="org-right">N/A</td>
<td class="org-right">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">LogSeq</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Zk</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Hyperbole</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">Built in</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Denote</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">??</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Eev</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">Built in</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Org-Zettelkasten</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">??</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Zetteldeft</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left"><a href="https://github.com/EFLS/zd-tutorial">zd-tutorial</a></td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Deft</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Org-Brain</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Bookmark Plus</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">howm</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

Legend

1.  No feature
2.  kinda has feature
3.  Has feature
4.  Has feature plus extras


# other interesting projects
