README.org
* ExoBrain packages compare and contrast


|---------------------+----------+----------+----------+------+-----------+------+-----------+------------+-------+---|
| Compare             | org mode | Org Roam | Koutline | Rolo | HyperBole | ZK   | Org Brain | Zetteldesk | Delve |   |
| Contrast            |          |          |          |      |     links |      |           |            |       |   |
|---------------------+----------+----------+----------+------+-----------+------+-----------+------------+-------+---|
| [[https://orgmode.org/][Org]]                 |          |          |          |      |           |      |           |            |       |   |
| [[https://www.orgroam.com/][Org Roam]]            |          |          |          |      |           |      |           |            |       |   |
| [[https://github.com/toshism/org-super-links][Org Super Links]]     |          |          |          |      |           |      |           |            |       |   |
| [[https://github.com/localauthor/zk][Zk]]                  |          |          |          |      |           |      |           |            |       |   |
| [[https://github.com/Vidianos-Giannitsis/zetteldesk.el][ZettelDesk]]          |        3 |        3 |        0 |    0 |         2 | 1    |         0 |            |     1 |   |
| [[https://www.emacswiki.org/emacs/BookmarkPlus][Bookmark Plus]]       |          |          |          |      |           |      |           |            |       |   |
| Hyperbole/links     |          |          |          |      |           |      |           |            |       |   |
| Hyperbole/Koutline  |          |          |          |      |           |      |           |            |       |   |
| Hyperbole/Rolo      |          |          |          |      |           |      |           |            |       |   |
| Denote              |          |          |          |      |           |      |           |            |       |   |
| Eev                 |          |          |          |      |           |      |           |            |       |   |
| [[https://github.com/l3kn/org-zettelkasten][Org-Zettelkasten]]    |          |          |          |      |           |      |           |            |       |   |
| [[https://www.eliasstorms.net/zetteldeft/][Zetteldeft]]          |          |          |          |      |           |      |           |            |       |   |
| [[https://jblevins.org/projects/deft/][Deft]]                |          |          |          |      |           |      |           |            |       |   |
| [[https://github.com/Kungsgeten/org-brain][Org-Brain]]           |          |          |          |      |           |      |           |            |       |   |
| howm                |          |          |          |      |           |      |           |            |       |   |
| [[https://github.com/publicimageltd/delve][Delve]]               |        3 |        3 |        0 |    0 |         2 | 1    |         0 |          1 |       |   |
| [[https://github.com/alphapapa/org-ql][org-ql]]              |        3 |        4 |        1 |    1 |         2 | 1,2¹ |         4 |          4 |     4 |   |
| [[https://github.com/alphapapa/org-graph-view][org-graph-view]]      |        3 |        1 |        0 |    0 |         2 | 1,2¹ |      1,4? |          2 |     2 |   |
| Org-drill/Org-fc    |          |          |          |      |           |      |           |            |       |   |
| Org-depend/Org-edna |          |          |          |      |           |      |           |            |       |   |
| Org-habbit          |          |          |          |      |           |      |           |            |       |   |
|---------------------+----------+----------+----------+------+-----------+------+-----------+------------+-------+---|


Legend
0) No support TODO -- messes up list if on same line level so FIXME 
   1) Alternative
   2) Supplemental
   3) Requires
   4) Extension



